In [17]:
import cx_Oracle
dsn = cx_Oracle.makedsn('localhost', 1521, 'orclhj')
db = cx_Oracle.connect('system', '1234', dsn)

sql = '''
    select * from emp
'''

In [18]:
import pandas as pd
data = pd.read_sql(sql, con=db)

In [19]:
data.head(2)

   EMPNO  ENAME      JOB     MGR   HIREDATE     SAL  COMM  DEPTNO
0   7369  SMITH    CLERK  7902.0 1980-12-17   800.0   NaN    20.0
1   7566  JONES  MANAGER  7839.0 1981-04-02  2975.0   NaN    30.0

In [20]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   EMPNO     15 non-null     int64
 1   ENAME     15 non-null     object
 2   JOB       14 non-null     object
 3   MGR       13 non-null     float64
 4   HIREDATE  14 non-null     datetime64[ns]
 5   SAL       15 non-null     float64
 6   COMM      4 non-null      float64
 7   DEPTNO    14 non-null     float64
dtypes: datetime64[ns](1), float64(4), int64(1), object(2)
memory usage: 1.1+ KB

In [21]:
data['HIREDATE'] = data['HIREDATE'].astype(str)

In [22]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   EMPNO     15 non-null     int64
 1   ENAME     15 non-null     object
 2   JOB       14 non-null     object
 3   MGR       13 non-null     float64
 4   HIREDATE  15 non-null     object
 5   SAL       15 non-null     float64
 6   COMM      4 non-null      float64
 7   DEPTNO    14 non-null     float64
dtypes: float64(4), int64(1), object(3)
memory usage: 1.1+ KB

In [28]:
data['YEAR'] = data['HIREDATE'].apply( lambda data: data.split('-')[0] )
# data['MONTH'] = data['HIREDATE'].apply( lambda data: data.split('-')[1] )
# data['DAY'] = data['HIREDATE'].apply( lambda data: data.split('-')[2] )

In [29]:
data.head(2)

   EMPNO  ENAME      JOB     MGR    HIREDATE     SAL  COMM  DEPTNO  YEAR
0   7369  SMITH    CLERK  7902.0  1980-12-17   800.0   NaN    20.0  1980
1   7566  JONES  MANAGER  7839.0  1981-04-02  2975.0   NaN    30.0  1981

In [36]:
data['HIREDATE'].apply( lambda data: data.split('-')[1] )

IndexError: list index out of range

In [32]:
data.head(1)

   EMPNO  ENAME    JOB     MGR    HIREDATE    SAL  COMM  DEPTNO  YEAR MONTH
0   7369  SMITH  CLERK  7902.0  1980-12-17  800.0   NaN    20.0  1980    17